---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.FillVisible
source: html/a16ccaf8-461b-226f-c40a-4956c69b36f8.htm
---
# Autodesk.Revit.DB.MEPSystemType.FillVisible Property

Indicates the visibility of the fill pattern for all components in the system.

## Syntax (C#)
```csharp
public bool FillVisible { get; set; }
```